stm32duino/Arduino_Core_STM32/system/Drivers/STM32C0xx_HAL_Driver/Inc/stm32c0xx_hal_rcc.h
/** @defgroup RCC_System_Clock_Source System Clock Source
  * @{
  */
#define RCC_SYSCLKSOURCE_HSI           0x00000000U                       /*!< HSI selection as system clock */
#define RCC_SYSCLKSOURCE_HSE           RCC_CFGR_SW_0                     /*!< HSE selection as system clock */
#if defined(RCC_HSI48_SUPPORT)
#define RCC_SYSCLKSOURCE_HSIUSB48      RCC_CFGR_SW_1                     /*!< HSIUSB48 selection used as system clock */
#endif /* RCC_HSI48_SUPPORT */
#define RCC_SYSCLKSOURCE_LSI           (RCC_CFGR_SW_1 | RCC_CFGR_SW_0)   /*!< LSI selection as system clock */
#define RCC_SYSCLKSOURCE_LSE           RCC_CFGR_SW_2                     /*!< LSE selection as system clock */
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Source_Status System Clock Source Status
  * @{
  */
#define RCC_SYSCLKSOURCE_STATUS_HSI           0x00000000U                       /*!< HSI used as system clock */
#define RCC_SYSCLKSOURCE_STATUS_HSE           RCC_CFGR_SWS_0                    /*!< HSE used as system clock */
#if defined(RCC_HSI48_SUPPORT)
#define RCC_SYSCLKSOURCE_STATUS_HSIUSB48      RCC_CFGR_SWS_1                    /*!< HSIUSB48 used as system clock */
#endif /* RCC_HSI48_SUPPORT */
#define RCC_SYSCLKSOURCE_STATUS_LSI           (RCC_CFGR_SWS_1 | RCC_CFGR_SWS_0) /*!< LSI used as system clock */
#define RCC_SYSCLKSOURCE_STATUS_LSE           RCC_CFGR_SWS_2                    /*!< LSE used as system clock */
/**
  * @}
  */

/** @defgroup RCC_SYS_Clock_Divider  RCC SYS Clock Divider
  * @{
  */
#if defined(RCC_CR_SYSDIV)
#define RCC_SYSCLK_DIV1          0x00000000U                                  /*!< SYSCLK not divided */
#define RCC_SYSCLK_DIV2          RCC_CR_SYSDIV_0                              /*!< SYSCLK is divided by 2 */
#define RCC_SYSCLK_DIV3          RCC_CR_SYSDIV_1                              /*!< SYSCLK is divided by 3 */
#define RCC_SYSCLK_DIV4          (RCC_CR_SYSDIV_1 | RCC_CR_SYSDIV_0)          /*!< SYSCLK is divided by 4 */
#define RCC_SYSCLK_DIV5          RCC_CR_SYSDIV_2                              /*!< SYSCLK is divided by 5 */
#define RCC_SYSCLK_DIV6          (RCC_CR_SYSDIV_2 | RCC_CR_SYSDIV_0)          /*!< SYSCLK is divided by 6 */
#define RCC_SYSCLK_DIV7          (RCC_CR_SYSDIV_2 | RCC_CR_SYSDIV_1)          /*!< SYSCLK is divided by 7 */
#define RCC_SYSCLK_DIV8          (RCC_CR_SYSDIV_2 | RCC_CR_SYSDIV_1 | RCC_CR_SYSDIV_0)   /*!< SYSCLK is divided by 8 */
#else
#define RCC_SYSCLK_DIV1          0x00000000U                                  /*!< SYSCLK not divided */
#endif /* RCC_CR_SYSDIV */
/**
  * @}
  */

/** @defgroup RCC_HCLK_Clock_Divider  RCC HCLK Clock Divider
  * @{
  */
#define RCC_HCLK_DIV1        0x00000000U                                                    /*!< HCLK not divided */
#define RCC_HCLK_DIV2        RCC_CFGR_HPRE_3                                                /*!< HCLK divided by 2 */
#define RCC_HCLK_DIV4        (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_0)                            /*!< HCLK divided by 4 */
#define RCC_HCLK_DIV8        (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_1)                            /*!< HCLK divided by 8 */
#define RCC_HCLK_DIV16       (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_1 | RCC_CFGR_HPRE_0)          /*!< HCLK divided by 16 */
#define RCC_HCLK_DIV64       (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_2)                            /*!< HCLK divided by 64 */
#define RCC_HCLK_DIV128      (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_2 | RCC_CFGR_HPRE_0)          /*!< HCLK divided by 128 */
#define RCC_HCLK_DIV256      (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_2 | RCC_CFGR_HPRE_1)          /*!< HCLK divided by 256 */
#define RCC_HCLK_DIV512      (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_2 | RCC_CFGR_HPRE_1 | RCC_CFGR_HPRE_0)  /*!< HCLK divided by 512 */
/**
  * @}
  */

/** @defgroup RCC_APB1_Clock_Divider  RCC APB1 Clock Divider
  * @{
  */
#define RCC_APB1_DIV1           0x00000000U                                             /*!< APB not divided */
#define RCC_APB1_DIV2           RCC_CFGR_PPRE_2                                         /*!< APB divided by 2  */
#define RCC_APB1_DIV4           (RCC_CFGR_PPRE_2 | RCC_CFGR_PPRE_0)                     /*!< APB divided by 4  */
#define RCC_APB1_DIV8           (RCC_CFGR_PPRE_2 | RCC_CFGR_PPRE_1)                     /*!< APB divided by 4  */
#define RCC_APB1_DIV16          (RCC_CFGR_PPRE_2 | RCC_CFGR_PPRE_1 | RCC_CFGR_PPRE_0)   /*!< APB divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_RTC_Clock_Source RTC Clock Source
  * @{
  */
#define RCC_RTCCLKSOURCE_NONE          0x00000000U         /*!< No clock configured for RTC */
#define RCC_RTCCLKSOURCE_LSE           RCC_CSR1_RTCSEL_0   /*!< LSE oscillator clock used as RTC clock */
#define RCC_RTCCLKSOURCE_LSI           RCC_CSR1_RTCSEL_1   /*!< LSI oscillator clock used as RTC clock */
#define RCC_RTCCLKSOURCE_HSE_DIV32     RCC_CSR1_RTCSEL     /*!< HSE oscillator clock divided by 32 used as RTC clock */
/**
  * @}
  */

/** @defgroup RCC_MCO_Index MCO Index
  * @{
  */

/* @cond */
/* 32     28      20       16      0
   --------------------------------
   | MCO   | GPIO  | GPIO  | GPIO  |
   | Index |  AF   | Port  |  Pin  |
   -------------------------------*/

#define RCC_MCO_GPIOPORT_POS   16U
#define RCC_MCO_GPIOPORT_MASK  (0xFUL << RCC_MCO_GPIOPORT_POS)
#define RCC_MCO_GPIOAF_POS     20U
#define RCC_MCO_GPIOAF_MASK    (0xFFUL << RCC_MCO_GPIOAF_POS)
#define RCC_MCO_INDEX_POS      28U
#define RCC_MCO_INDEX_MASK     (0x1UL << RCC_MCO_INDEX_POS)

#define RCC_MCO1_INDEX         (0x0UL << RCC_MCO_INDEX_POS)             /*!< MCO1 index */
#define RCC_MCO2_INDEX         (0x1UL << RCC_MCO_INDEX_POS)             /*!< MCO2 index */
/* @endcond */

#define RCC_MCO1_PA8           (RCC_MCO1_INDEX |\
                                (GPIO_AF0_MCO << RCC_MCO_GPIOAF_POS) | \
                                (GPIO_GET_INDEX(GPIOA) << RCC_MCO_GPIOPORT_POS) | GPIO_PIN_8)
#define RCC_MCO1_PA9           (RCC_MCO1_INDEX |\
                                (GPIO_AF0_MCO << RCC_MCO_GPIOAF_POS) | \
                                (GPIO_GET_INDEX(GPIOA) << RCC_MCO_GPIOPORT_POS) | GPIO_PIN_9)
#define RCC_MCO1_PF2           (RCC_MCO1_INDEX |\
                                (GPIO_AF0_MCO << RCC_MCO_GPIOAF_POS) | \
                                (GPIO_GET_INDEX(GPIOF) << RCC_MCO_GPIOPORT_POS) | GPIO_PIN_2)
#define RCC_MCO1               RCC_MCO1_PA8         /*!< Alias for compatibility */

